const quoteContainer = document.getElementById('quote');

document.addEventListener('DOMContentLoaded', generateQuote);

function generateQuote() {
    const quotes = [
        'Бог дав вам тіло, яке може витримати майже все. Ваше завдання – переконати в цьому свій розум.',
        'Неважливо, як повільно ти просувається. Головне – ти не зупиняєшся.',
        'Більшість людей ніколи не біжить досить довго на своєму першому диханні, щоб дізнатися, що у них є друге.',
        'Якщо ти хочеш бути кращим за інших, то приготуйся робити те, що інші не хочуть робити.',
        'Фізичні вправи можуть замінити безліч ліків, але жодні ліки в світі не можуть замінити фізичні вправи.',
        'Сміливість не означає, що ви не боїтеся. Сміливість означає, що ви не дозволяєте страху зупинити вас.',
        'Сила волі – це м’яз, який потребує тренувань, точно так само, як і м’язи тіла.',
        'Не тікайте від виклику. Замість цього біжіть до нього, тому що єдиний спосіб уникнути страху – розтоптати його під ногами.',
        'Переможе не той, хто сильніший, а той, хто готовий йти до кінця.',
        'Досконалість – це не одиничний акт, а звичка. Ви – це те, що ви робите багато разів.',
        'Золоті медалі зроблені не з золота. Вони зроблені з поту, рішучості і рідкісного сплаву, який називається силою волі.',
        'Зробіть хоча б раз те, що, за словами оточуючих, вам не по плечу. Після цього ви вже ніколи не будете звертати увагу на їхні правила і обмеження.',
        'Межі, так само як і страхи, найчастіше виявляються просто ілюзіями.',
        'Я розпалюю вогонь і кожен день тренуюся, додаючи все більше палива. У потрібний момент я запалю сірник.',
        'Спорт — ліки від поганого настрою і депресій.',
        'Ніщо так не виснажує і не руйнує організм, як фізична бездіяльність.',
        'Існує три причини неявки на тренування: помер, захворів та помер, або вбили.'
    ];

    let generatedQuote = quotes[Math.floor(Math.random() * quotes.length)];
    quoteContainer.textContent = generatedQuote;
}